Repository: phil-tbs/GCFoundation
Catalog: GCFoundation.Web/Resources/Components.*.resx
Languages: fr

# GcdsHeading
source: GC Design System Components
fr: Composants du Système de design GC

# GcdsParagraph1
source: All GC Design System components are compatible out of the box. Just make sure the library is configured to point to the latest version. If the version was recently updated, you may not yet see autocomplete suggestions in Foundation.
fr: Tous les composants du Système de design GC sont compatibles dès le départ. Assurez-vous simplement que la bibliothèque est configurée pour utiliser la dernière version. Si la version a été récemment mise à jour, il se peut que la saisie semi-automatique ne soit pas encore disponible dans Foundation.

# GcdsLinkText
source: Find all components in the <gcds-link href="https://design-system.alpha.canada.ca/en/components/" target="_blank" external> GC Design System documentation </gcds-link>.
fr: Trouvez tous les composants dans la <gcds-link href="https://systeme-design.alpha.canada.ca/fr/composants/" target="_blank" external> documentation du Système de design GC </gcds-link>.

# GcdsParagraph2
source: To use GC Design System components, you’ll need to use the Web Component code. The components should also appear in Visual Studio if they have been implemented. However, even if a component doesn't appear in IntelliSense, you can still use it—just make sure you’re referencing the correct version of the GC Design System.
fr: Pour utiliser les composants du Système de design GC, vous devez utiliser le code des Web Components. Les composants devraient également apparaître dans Visual Studio s’ils ont été implémentés. Cependant, même si un composant n’apparaît pas dans IntelliSense, vous pouvez toujours l’utiliser—assurez-vous simplement de référencer la bonne version du Système de design GC.

# Badges_Title
source: FDCP Badge Documentation
fr: FDCP badge documnentation

# Badges_Overview_Title
source: Overview
fr: Aperçu

# Badges_Overview_Text
source: The <code>&lt;fdcp-badge&gt;</code> component is used to highlight small pieces of information...
fr: Le composant <code>&lt;fdcp-badge&gt;</code> est utilisé pour mettre en évidence de petites informations...

# Badges_Solid_Title
source: Solid Variants
fr: Variantes pleines

# Badges_Solid_Text
source: These badges use a solid background.
fr: Ces badges utilisent un fond uni.

# Badges_Inverted_Title
source: Inverted Variants
fr: Variantes inversées

# Badges_Inverted_Text
source: Use the <code>inverted="true"</code> attribute to render badges with transparent backgrounds.
fr: Utilisez l’attribut <code>inverted="true"</code> pour afficher des badges avec un fond transparent.

# Badges_Slot_Title
source: Start and End
fr: Début et fin

# Badges_Slot_Text
source: You can insert an icon or button at the start or end using either the <code>slot</code> attribute or the <code>StartContent</code>/<code>EndContent</code> properties.
fr: Vous pouvez insérer une icône ou un bouton au début ou à la fin en utilisant soit l’attribut <code>slot</code>, soit les propriétés <code>StartContent</code> / <code>EndContent</code>.

# Badges_Dismissible_Title
source: Dismissible Badge
fr: Badge supprimable

# Badges_Parameters_Title
source: Parameters
fr: Paramètres

# Badges_Parameters_Style
source: Badge style (Primary, Success, Danger, Info, etc.)
fr: Style du badge (Primaire, Succès, Danger, Info, etc.)

# Badges_Parameters_Inverted
source: Applies an inverted, outline-style badge.
fr: Applique un badge inversé avec bordure.

# Badges_Parameters_StartContent
source: Optional HTML to prepend before the badge content.
fr: HTML facultatif à afficher avant le contenu du badge.

# Badges_Parameters_EndContent
source: Optional HTML to append after the badge content.
fr: HTML facultatif à afficher après le contenu du badge.

# Badges_Parameters_TagId
source: Optional <code>id</code> attribute for the badge element.
fr: Attribut <code>id</code> facultatif pour l’élément du badge.

# Badges_Notes_1
source: Use <code>slot="start-content"</code> and <code>slot="end-content"</code> when embedding HTML.
fr: Utilisez <code>slot="start-content"</code> et <code>slot="end-content"</code> pour inclure du HTML.

# Badges_Notes_2
source: For font icons, use libraries like Font Awesome or Bootstrap Icons.
fr: Pour les icônes, utilisez Font Awesome ou Bootstrap Icons.

# Badges_Notes_3
source: All badges are rendered as <code>&lt;span&gt;</code> elements with class <code>fdcp-badge</code>.
fr: Tous les badges sont rendus en tant qu’éléments <span> avec la classe <code>fdcp-badge</code>.

# Badges_Inverted_Anchor
source: inverted
fr: inversees

# Badges_Overview_Anchor
source: overview
fr: apercu

# Badges_Solid_Anchor
source: solid
fr: plein

# Badges_Slot_Anchor
source: start-end
fr: debut-fin

# Badges_Parameters_Anchor
source: parameters
fr: Parametres

# GlobalResources_Title
source: Global Resources Configuration
fr: Configuration des ressources globales

# GlobalResources_Description
source: This page demonstrates how to use the new global resources configuration feature in GCFoundation. You can configure CSS, JavaScript, meta tags, and link tags globally through the appsettings.json file.
fr: Cette page démontre comment utiliser la nouvelle fonctionnalité de configuration des ressources globales dans GCFoundation. Vous pouvez configurer les fichiers CSS, JavaScript, les balises meta et les balises link globalement via le fichier appsettings.json.

# GlobalResources_CurrentConfiguration_Title
source: Current Configuration
fr: Configuration actuelle

# GlobalResources_CurrentConfiguration_Description
source: The following resources are currently configured to be loaded globally:
fr: Les ressources suivantes sont actuellement configurées pour être chargées globalement :

# GlobalResources_GlobalCssFiles_Title
source: Global CSS Files
fr: Fichiers CSS globaux

# GlobalResources_GlobalJavaScriptFiles_Title
source: Global JavaScript Files
fr: Fichiers JavaScript globaux

# GlobalResources_GlobalMetaTags_Title
source: Global Meta Tags
fr: Balises meta globales

# GlobalResources_GlobalLinkTags_Title
source: Global Link Tags
fr: Balises link globales

# GlobalResources_NoCssFiles
source: No global CSS files configured.
fr: Aucun fichier CSS global configuré.

# GlobalResources_NoJavaScriptFiles
source: No global JavaScript files configured.
fr: Aucun fichier JavaScript global configuré.

# GlobalResources_NoMetaTags
source: No global meta tags configured.
fr: Aucune balise meta globale configurée.

# GlobalResources_NoLinkTags
source: No global link tags configured.
fr: Aucune balise link globale configurée.

# GlobalResources_ResourceInclusion_Title
source: Resource Inclusion Settings
fr: Paramètres d'inclusion des ressources

# GlobalResources_ResourceInclusion_Description
source: The following settings control which optional resources are included:
fr: Les paramètres suivants contrôlent quelles ressources optionnelles sont incluses :

# GlobalResources_DefaultCss_Label
source: Default CSS:
fr: CSS par défaut :

# GlobalResources_DefaultJavaScript_Label
source: Default JavaScript:
fr: JavaScript par défaut :

# GlobalResources_GCDSResources_Label
source: GCDS Resources:
fr: Ressources GCDS :

# GlobalResources_AlwaysEnabled
source: Always Enabled
fr: Toujours activé

# GlobalResources_Enabled
source: Enabled
fr: Activé

# GlobalResources_Disabled
source: Disabled
fr: Désactivé

# GlobalResources_DefaultFilesNote
source: Note: Default foundation CSS and JavaScript files are always included and cannot be disabled. This ensures that all GCFoundation components work properly on every page.
fr: Note : Les fichiers CSS et JavaScript de base de GCFoundation sont toujours inclus et ne peuvent pas être désactivés. Cela garantit que tous les composants GCFoundation fonctionnent correctement sur chaque page.

# GlobalResources_LoadingOrder_Title
source: Resource Loading Order
fr: Ordre de chargement des ressources

# GlobalResources_LoadingOrder_Description
source: Resources are loaded in the following order:
fr: Les ressources sont chargées dans l'ordre suivant :

# GlobalResources_CssLoadingOrder_Title
source: CSS Loading Order
fr: Ordre de chargement CSS

# GlobalResources_JavaScriptLoadingOrder_Title
source: JavaScript Loading Order
fr: Ordre de chargement JavaScript

# GlobalResources_HowToConfigure_Title
source: How to Configure
fr: Comment configurer

# GlobalResources_HowToConfigure_Description
source: To configure global resources, update your appsettings.json file:
fr: Pour configurer les ressources globales, mettez à jour votre fichier appsettings.json :

# GlobalResources_UsingHelper_Title
source: Using GlobalResourceHelper in Views
fr: Utilisation de GlobalResourceHelper dans les vues

# GlobalResources_UsingHelper_Description
source: You can also use the GlobalResourceHelper in your Razor views for more control:
fr: Vous pouvez également utiliser GlobalResourceHelper dans vos vues Razor pour plus de contrôle :

# UserLogin_AuthStatus_Title
source: Current Authentication Status
fr: État actuel d'authentification

# UserLogin_Authenticated_Message
source: You are currently logged in as {0}
fr: Vous êtes actuellement connecté en tant que {0}

# UserLogin_NotAuthenticated_Message
source: You are not currently logged in. Use the simulate login button below to test the authenticated state.
fr: Vous n'êtes pas actuellement connecté. Utilisez le bouton de simulation de connexion ci-dessous pour tester l'état authentifié.

# UserLogin_SimulateLogin
source: Simulate Login
fr: Simuler la connexion

# UserLogin_SimulateLogout
source: Simulate Logout
fr: Simuler la déconnexion

# UserLogin_ApiTest_Message
source: See how to integrate with APIs to get user information.
fr: Voir comment intégrer avec les API pour obtenir les informations utilisateur.

# UserLogin_ApiTest_Link
source: API test
fr: Test API

# UserLogin_PageTitle
source: User Login Partial Examples
fr: Exemples de partiel de connexion utilisateur

# UserLogin_Component_Title
source: User Login Partial Component
fr: Composant partiel de connexion utilisateur

# UserLogin_Position_PageTitle
source: User Login in {0} Position
fr: Connexion utilisateur en position {0}

# UserLogin_PageDescription
source: This page demonstrates the configurable User Login partial component with English and French localization support. The partial can be customized through configuration settings and displays different information based on authentication status.
fr: Cette page démontre le composant partiel de connexion utilisateur configurable avec support de localisation en anglais et français. Le partiel peut être personnalisé grâce aux paramètres de configuration et affiche différentes informations selon l'état d'authentification.

# UserLogin_TestAuthStates
source: Test the login partial with different authentication states.
fr: Testez le partiel de connexion avec différents états d'authentification.

# UserLogin_ConfigurationOptions
source: Configuration Options
fr: Options de configuration

# UserLogin_ConfigDescription
source: The User Login partial supports the following configuration options through appsettings.json:
fr: Le partiel de connexion utilisateur prend en charge les options de configuration suivantes via appsettings.json :

# UserLogin_Features
source: Features
fr: Fonctionnalités

# UserLogin_Feature_Bilingual
source: Fully bilingual (English/French) with automatic language detection
fr: Entièrement bilingue (anglais/français) avec détection automatique de la langue

# UserLogin_Feature_Configurable
source: Configurable display options (show/hide various user information)
fr: Options d'affichage configurables (afficher/masquer diverses informations utilisateur)

# UserLogin_Feature_CompactFull
source: Compact and full display modes
fr: Modes d'affichage compact et complet

# UserLogin_Feature_SessionTimeout
source: Session timeout warnings and countdown
fr: Avertissements et compte à rebours d'expiration de session

# UserLogin_Feature_Avatar
source: User avatar support with automatic initials generation
fr: Support d'avatar utilisateur avec génération automatique d'initiales

# UserLogin_Feature_GCDS
source: GCDS component integration for consistent Government of Canada styling
fr: Intégration des composants GCDS pour un style cohérent du gouvernement du Canada

# UserLogin_Feature_Responsive
source: Responsive design for mobile and desktop
fr: Design réactif pour mobile et ordinateur de bureau

# UserLogin_Feature_Accessibility
source: Accessibility features with proper ARIA labels
fr: Fonctionnalités d'accessibilité avec étiquettes ARIA appropriées

# UserLogin_Feature_Integration
source: Easy integration with existing authentication systems
fr: Intégration facile avec les systèmes d'authentification existants

# UserLogin_Position_Description
source: This example shows how the User Login partial can be positioned in different areas of your application.
fr: Cet exemple montre comment le partiel de connexion utilisateur peut être positionné dans différentes zones de votre application.

# UserLogin_Position_Header_Alert
source: The login partial is displayed in the header area (above this content).
fr: Le partiel de connexion est affiché dans la zone d'en-tête (au-dessus de ce contenu).

# UserLogin_Position_Sidebar_Title
source: Sidebar Login
fr: Connexion dans la barre latérale

# UserLogin_Position_Sidebar_Content
source: This is the main content area. The login partial is displayed in the sidebar to the left (on desktop) or above (on mobile).
fr: Ceci est la zone de contenu principal. Le partiel de connexion est affiché dans la barre latérale à gauche (sur ordinateur) ou au-dessus (sur mobile).

# UserLogin_Position_Inline_Title
source: Inline Login Information
fr: Informations de connexion en ligne

# UserLogin_Position_Content_Before
source: This is content before the login partial.
fr: Ceci est le contenu avant le partiel de connexion.

# UserLogin_Position_Content_After
source: This is content after the login partial.
fr: Ceci est le contenu après le partiel de connexion.

# UserLogin_Position_Footer_Title
source: Footer Login
fr: Connexion dans le pied de page

# UserLogin_Position_Footer_Content
source: The main content area. The login partial will be displayed in the footer area (below this content).
fr: La zone de contenu principal. Le partiel de connexion sera affiché dans la zone de pied de page (sous ce contenu).

# UserLogin_Position_BackToExamples
source: ← Back to Examples
fr: ← Retour aux exemples

# UserLogin_Component_Description
source: A configurable, bilingual user login information component that displays authentication status, user details, and session information. Perfect for Azure cloud deployments with stateless authentication.
fr: Un composant d'informations de connexion utilisateur configurable et bilingue qui affiche l'état d'authentification, les détails utilisateur et les informations de session. Parfait pour les déploiements cloud Azure avec authentification sans état.

# UserLogin_LiveExamples
source: Live Examples
fr: Exemples en direct

# UserLogin_LiveExamples_Description
source: Below are working examples of the User Login Partial in different configurations:
fr: Voici des exemples fonctionnels du partiel de connexion utilisateur dans différentes configurations :

# UserLogin_CurrentUserState
source: Live Example - Current User State
fr: Exemple en direct - État utilisateur actuel

# UserLogin_CurrentUserState_Description
source: This shows the actual authentication state from the current user context.
fr: Ceci montre l'état d'authentification réel du contexte utilisateur actuel.

# UserLogin_SimulateLoginNote
source: Use the "Simulate Login" button in the Examples section to see the authenticated state.
fr: Utilisez le bouton "Simuler la connexion" dans la section Exemples pour voir l'état authentifié.

# UserLogin_DefaultMode
source: Default Mode
fr: Mode par défaut

# UserLogin_DefaultMode_Description
source: Standard full display mode with user information.
fr: Mode d'affichage complet standard avec informations utilisateur.

# UserLogin_SessionExpiring
source: Session Expiring Soon
fr: Session expirant bientôt

# UserLogin_SessionExpiring_Description
source: Example showing session timeout warning.
fr: Exemple montrant l'avertissement d'expiration de session.

# UserLogin_NotAuthenticatedState
source: Not Authenticated State
fr: État non authentifié

# UserLogin_NotAuthenticatedState_Description
source: Display for users who are not logged in.
fr: Affichage pour les utilisateurs qui ne sont pas connectés.

# UserLogin_ConfigOptions_Description
source: The User Login Partial is highly configurable through appsettings.json and supports both stateless and session-based authentication systems.
fr: Le partiel de connexion utilisateur est hautement configurable via appsettings.json et prend en charge les systèmes d'authentification avec et sans état.

# UserLogin_KeyFeatures
source: Key Features
fr: Fonctionnalités clés

# UserLogin_BilingualSupport
source: 🌐 Bilingual Support
fr: 🌐 Support bilingue

# UserLogin_BilingualSupport_Description
source: Automatic English/French localization with resource files and culture detection.
fr: Localisation automatique anglais/français avec fichiers de ressources et détection de culture.

# UserLogin_CloudReady
source: ☁️ Cloud Ready
fr: ☁️ Prêt pour le cloud

# UserLogin_CloudReady_Description
source: Stateless authentication support perfect for Azure App Service and container deployments.
fr: Support d'authentification sans état parfait pour Azure App Service et les déploiements de conteneurs.

# UserLogin_Configurable_Description
source: 15+ configuration options to customize display and behavior for your needs.
fr: Plus de 15 options de configuration pour personnaliser l'affichage et le comportement selon vos besoins.

# UserLogin_Responsive
source: 📱 Responsive
fr: 📱 Réactif

# UserLogin_Responsive_Description
source: Mobile-first design that works perfectly on all device sizes.
fr: Design mobile-first qui fonctionne parfaitement sur toutes les tailles d'appareils.

# UserLogin_GCDSStyled
source: 🎨 GCDS Styled
fr: 🎨 Style GCDS

# UserLogin_GCDSStyled_Description
source: Uses Government of Canada Design System components for consistent styling.
fr: Utilise les composants du système de design du gouvernement du Canada pour un style cohérent.

# UserLogin_Accessible_Description
source: WCAG compliant with proper ARIA labels and semantic markup.
fr: Conforme WCAG avec étiquettes ARIA appropriées et balisage sémantique.

# UserLogin_SupportedAuthMethods
source: Supported Authentication Methods
fr: Méthodes d'authentification prises en charge

# UserLogin_SupportedAuthMethods_Description
source: The component automatically extracts user information from claims, making it compatible with various authentication systems:
fr: Le composant extrait automatiquement les informations utilisateur des revendications, le rendant compatible avec divers systèmes d'authentification :

# UserLogin_CookieAuth
source: Cookie Authentication
fr: Authentification par cookie

# UserLogin_CookieAuth_Description
source: Stateless cookie-based auth without server-side sessions. Perfect for Azure cloud deployments.
fr: Authentification sans état basée sur les cookies sans sessions côté serveur. Parfait pour les déploiements cloud Azure.

# UserLogin_AzureAD_Description
source: Enterprise authentication with Office 365 integration and single sign-on support.
fr: Authentification d'entreprise avec intégration Office 365 et support de connexion unique.

# UserLogin_JWTTokens
source: JWT Tokens
fr: Jetons JWT

# UserLogin_JWTTokens_Description
source: JSON Web Token authentication for API-first applications and microservices.
fr: Authentification par jeton Web JSON pour les applications API-first et les microservices.

# UserLogin_ExternalProviders
source: External Providers
fr: Fournisseurs externes

# UserLogin_ExternalProviders_Description
source: OAuth integration with Google, GitHub, Microsoft, and other external providers.
fr: Intégration OAuth avec Google, GitHub, Microsoft et autres fournisseurs externes.

# UserLogin_AdditionalResources
source: Additional Resources
fr: Ressources supplémentaires

# UserLogin_CompleteExamples
source: Complete Examples
fr: Exemples complets

# UserLogin_CompleteExamples_Description
source: Interactive examples with different configurations and use cases.
fr: Exemples interactifs avec différentes configurations et cas d'usage.

# UserLogin_StatelessAuth
source: Stateless Authentication
fr: Authentification sans état

# UserLogin_StatelessAuth_Description
source: Azure cloud-ready authentication examples without sessions.
fr: Exemples d'authentification prêts pour le cloud Azure sans sessions.

# UserLogin_TemplateIntegration
source: Template Integration
fr: Intégration de modèle

# UserLogin_TemplateIntegration_Description
source: Learn how to integrate the partial into your layout templates.
fr: Apprenez comment intégrer le partiel dans vos modèles de mise en page.

# UserLogin_QuickImplementation
source: Quick Implementation Guide
fr: Guide d'implémentation rapide

# Cards_Title
source: FDCP Card Documentation
fr: Documentation des cartes FDCP

# Cards_Overview_Title
source: Overview
fr: Aperçu

# Cards_Overview_Anchor
source: overview
fr: apercu

# Cards_Basic_Title
source: Basic Card
fr: Carte de base

# Cards_Basic_Anchor
source: basic
fr: base

# Cards_WithSlots_Title
source: Cards with Header and Footer
fr: Cartes avec en-tête et pied de page

# Cards_WithImages_Title
source: Cards with Images
fr: Cartes avec images

# Cards_Horizontal_Title
source: Horizontal Cards
fr: Cartes horizontales

# Cards_Parameters_Title
source: Parameters
fr: Paramètres

# Cards_Parameters_Anchor
source: parameters
fr: parametres

# Cards_Overview_Text
source: The <code>&lt;fdcp-card&gt;</code> component provides a flexible and extensible content container inspired by Bootstrap cards, designed with Government of Canada Design System (GCDS) styling. It includes options for headers, footers, images, and various contextual background colors.
fr: Le composant <code>&lt;fdcp-card&gt;</code> fournit un conteneur de contenu flexible et extensible inspiré des cartes Bootstrap, conçu avec le style du Système de design du gouvernement du Canada (SGDC). Il inclut des options pour les en-têtes, pieds de page, images et diverses couleurs d'arrière-plan contextuelles.

# Cards_Basic_Text
source: A basic card with mixed content and flexible width.
fr: Une carte de base avec contenu mixte et largeur flexible.

# Cards_WithSlots_Text
source: Use the <code>slot</code> attribute to define header, body, and footer sections.
fr: Utilisez l'attribut <code>slot</code> pour définir les sections d'en-tête, corps et pied de page.

# Cards_WithImages_Text
source: Cards support top and bottom images using the <code>image-top</code> and <code>image-bottom</code> attributes.
fr: Les cartes supportent les images en haut et en bas en utilisant les attributs <code>image-top</code> et <code>image-bottom</code>.

# Cards_Horizontal_Text
source: Use the <code>horizontal="true"</code> attribute to create horizontal card layouts.
fr: Utilisez l'attribut <code>horizontal="true"</code> pour créer des dispositions de cartes horizontales.

# Cards_Parameters_TagId
source: Optional <code>id</code> attribute for the card element.
fr: Attribut <code>id</code> optionnel pour l'élément carte.

# Cards_Parameters_Width
source: Sets the width of the card using CSS value (e.g., "18rem", "300px", "100%").
fr: Définit la largeur de la carte en utilisant une valeur CSS (ex: "18rem", "300px", "100%").

# Cards_Parameters_Height
source: Sets the height of the card using CSS value (e.g., "200px", "auto", "100%").
fr: Définit la hauteur de la carte en utilisant une valeur CSS (ex: "200px", "auto", "100%").
