Repository: phil-tbs/GCFoundation
Catalog: GCFoundation.Web/Resources/Components.*.resx
Languages: fr

# Cards_Parameters_Border
source: Whether the card should have a border. Default is true.
fr: Si la carte doit avoir une bordure. Par défaut: true.

# Cards_Parameters_Shadow
source: Whether the card should have a shadow. Default is false.
fr: Si la carte doit avoir une ombre. Par défaut: false.

# Cards_Parameters_ImageTop
source: URL for the card image that appears at the top.
fr: URL pour l'image de la carte qui apparaît en haut.

# Cards_Parameters_ImageBottom
source: URL for the card image that appears at the bottom.
fr: URL pour l'image de la carte qui apparaît en bas.

# Cards_Parameters_ImageAlt
source: Alt text for the card images.
fr: Texte alternatif pour les images de la carte.

# Cards_Parameters_Horizontal
source: Whether the card should use horizontal layout. Default is false.
fr: Si la carte doit utiliser une disposition horizontale. Par défaut: false.

# Cards_Notes_1
source: Use <code>slot="header"</code>, <code>slot="body"</code>, and <code>slot="footer"</code> to define card sections.
fr: Utilisez <code>slot="header"</code>, <code>slot="body"</code> et <code>slot="footer"</code> pour définir les sections de la carte.

# Cards_Notes_2
source: Cards are responsive and will adapt to their container width unless a specific width is set.
fr: Les cartes sont réactives et s'adaptent à la largeur de leur conteneur sauf si une largeur spécifique est définie.

# Cards_Notes_3
source: All cards use GCDS color variables for consistent Government of Canada styling.
fr: Toutes les cartes utilisent les variables de couleur SGDC pour un style cohérent du gouvernement du Canada.

# StatelessAuth_Demo_Title
source: Stateless Authentication Demo
fr: Démonstration d'authentification sans état

# StatelessAuth_Demo_Description
source: Try the cookie authentication below and see how the User Login Partial updates automatically.
fr: Essayez l'authentification par cookie ci-dessous et voyez comment le partiel de connexion utilisateur se met à jour automatiquement.

# StatelessAuth_CurrentStatus_Title
source: Current Authentication Status
fr: Statut d'authentification actuel

# StatelessAuth_Authenticated_Description
source: The User Login Partial above shows your current session information from claims (no server-side session storage).
fr: Le partiel de connexion utilisateur ci-dessus affiche vos informations de session actuelles à partir des revendications (aucun stockage de session côté serveur).

# StatelessAuth_NotAuthenticated_Description
source: Notice how the User Login Partial will update automatically after login.
fr: Remarquez comment le partiel de connexion utilisateur se mettra à jour automatiquement après la connexion.

# StatelessAuth_CookieDemo_Title
source: Cookie Authentication Demo
fr: Démonstration d'authentification par cookie

# StatelessAuth_CookieDemo_Description
source: Test cookie-based authentication without server sessions. All user data comes from claims in the authentication cookie.
fr: Testez l'authentification basée sur les cookies sans sessions serveur. Toutes les données utilisateur proviennent des revendications dans le cookie d'authentification.

# StatelessAuth_LoggedIn_Text
source: You're logged in! Click logout to clear the authentication cookie.
fr: Vous êtes connecté ! Cliquez sur déconnexion pour effacer le cookie d'authentification.

# StatelessAuth_LoggedOut_Text
source: This will create an authentication cookie with user claims (no session storage).
fr: Ceci créera un cookie d'authentification avec des revendications utilisateur (aucun stockage de session).

# StatelessAuth_Login_Button
source: 🔐 Login with Cookie Auth
fr: 🔐 Connexion avec authentification par cookie

# StatelessAuth_Logout_Button
source: 🚪 Logout
fr: 🚪 Déconnexion

# StatelessAuth_TechnicalInfo_Title
source: Technical Information
fr: Informations techniques

# StatelessAuth_Benefit_Claims
source: ✅ Claims stored in authentication cookie
fr: ✅ Revendications stockées dans le cookie d'authentification

# StatelessAuth_Benefit_NoSessions
source: ✅ No server-side session storage required
fr: ✅ Aucun stockage de session côté serveur requis

# StatelessAuth_Benefit_Azure
source: ✅ Scales automatically in Azure cloud
fr: ✅ Mise à l'échelle automatique dans le cloud Azure

# StatelessAuth_Benefit_LoadBalanced
source: ✅ Works across load-balanced servers
fr: ✅ Fonctionne sur des serveurs équilibrés en charge

# StatelessAuth_ViewClaims_Button
source: 📊 View Current Claims
fr: 📊 Voir les revendications actuelles

# StatelessAuth_CheckAuth_Button
source: ⚡ Check Auth Status
fr: ⚡ Vérifier le statut d'authentification

# StatelessAuth_DemoResults_Title
source: Demo Results
fr: Résultats de la démonstration

# StatelessAuth_Methods_Title
source: Available Stateless Authentication Methods
fr: Méthodes d'authentification sans état disponibles

# StatelessAuth_Methods_Description
source: The GC Foundation supports multiple stateless authentication approaches for Azure cloud deployment:
fr: La fondation GC prend en charge plusieurs approches d'authentification sans état pour le déploiement cloud Azure :

# StatelessAuth_CookieAuth_Title
source: 🍪 Cookie Authentication
fr: 🍪 Authentification par cookie

# StatelessAuth_CookieAuth_Description
source: Uses authentication cookies with claims (no server sessions). ✅ Recommended for most web apps.
fr: Utilise des cookies d'authentification avec des revendications (aucune session serveur). ✅ Recommandé pour la plupart des applications web.

# StatelessAuth_CookieAuth_Benefit1
source: No server-side storage required
fr: Aucun stockage côté serveur requis

# StatelessAuth_CookieAuth_Benefit2
source: Scales automatically in Azure
fr: Mise à l'échelle automatique dans Azure

# StatelessAuth_CookieAuth_Benefit3
source: Works across load-balanced servers
fr: Fonctionne sur des serveurs équilibrés en charge

# StatelessAuth_AzureAD_Title
source: 🏢 Azure AD Integration
fr: 🏢 Intégration Azure AD

# StatelessAuth_AzureAD_Description
source: Enterprise authentication with Microsoft identity platform. Perfect for government applications.
fr: Authentification d'entreprise avec la plateforme d'identité Microsoft. Parfait pour les applications gouvernementales.

# StatelessAuth_AzureAD_Benefit1
source: Single sign-on (SSO)
fr: Authentification unique (SSO)

# StatelessAuth_AzureAD_Benefit2
source: Multi-factor authentication
fr: Authentification multifacteur

# StatelessAuth_AzureAD_Benefit3
source: Office 365 integration
fr: Intégration Office 365

# StatelessAuth_JWT_Title
source: 🔑 JWT Tokens
fr: 🔑 Jetons JWT

# StatelessAuth_JWT_Description
source: Stateless API authentication using JSON Web Tokens. Ideal for microservices and APIs.
fr: Authentification API sans état utilisant des jetons Web JSON. Idéal pour les microservices et APIs.

# StatelessAuth_JWT_Benefit1
source: Completely stateless
fr: Complètement sans état

# StatelessAuth_JWT_Benefit2
source: Cross-platform compatibility
fr: Compatibilité multiplateforme

# StatelessAuth_JWT_Benefit3
source: Can be verified independently
fr: Peut être vérifié indépendamment

# StatelessAuth_OAuth_Title
source: 🌐 OAuth Providers
fr: 🌐 Fournisseurs OAuth

# StatelessAuth_OAuth_Description
source: External authentication providers (Google, GitHub, etc.). Good for public-facing applications.
fr: Fournisseurs d'authentification externes (Google, GitHub, etc.). Bon pour les applications publiques.

# StatelessAuth_OAuth_Benefit1
source: No credential management
fr: Aucune gestion d'identifiants

# StatelessAuth_OAuth_Benefit2
source: User convenience
fr: Commodité utilisateur

# StatelessAuth_OAuth_Benefit3
source: Social login options
fr: Options de connexion sociale

# StatelessAuth_Integration_Title
source: 💡 Integration with User Login Partial
fr: 💡 Intégration avec le partiel de connexion utilisateur

# Index_Forms_Title
source: Forms
fr: Formulaires

# Index_Forms_Description
source: A way to create forms
fr: Un moyen de créer des formulaires

# Index_Table_Title
source: Table
fr: Tableau

# Index_Table_Description
source: A way to display information in a table
fr: Un moyen d'afficher des informations dans un tableau

# Index_Modal_Title
source: Modal
fr: Fenêtre modale

# Index_Modal_Description
source: A way to display information in a popup box (modal)
fr: Un moyen d'afficher des informations dans une boîte de dialogue (modale)

# Index_FilteredSearch_Title
source: Filtered search
fr: Recherche filtrée

# Index_FilteredSearch_Description
source: A way to display search with filtered result
fr: Un moyen d'afficher une recherche avec des résultats filtrés

# Index_Badge_Description
source: A way to display tags
fr: Un moyen d'afficher des étiquettes

# Index_Card_Title
source: Card
fr: Carte

# Index_Card_Description
source: Flexible content containers with headers, footers, and images
fr: Conteneurs de contenu flexibles avec en-têtes, pieds de page et images

# Index_PageHeading_Title
source: Page heading
fr: En-tête de page

# Index_PageHeading_Description
source: A way to add main heading at the top of the page
fr: Un moyen d'ajouter un titre principal en haut de la page

# Index_FormBuilder_Title
source: Form builder
fr: Constructeur de formulaires

# Index_FormBuilder_Description
source: A way to build form automatically from a structure
fr: Un moyen de construire automatiquement un formulaire à partir d'une structure

# Index_Stepper_Title
source: Stepper
fr: Étapes

# Index_Stepper_Description
source: Create a stepper for a flow or a form
fr: Créer un processus étape par étape pour un flux ou un formulaire

# Index_UserLoginPartial_Title
source: User Login Partial
fr: Partiel de connexion utilisateur

# Index_UserLoginPartial_Description
source: Configurable user login information display with bilingual support
fr: Affichage configurable des informations de connexion utilisateur avec support bilingue

# Index_Page_Title
source: Components
fr: Composantes
